In [134]:
# List of high schools
high_schools = ["Hernandez High School", "Figueroa High School",
                "Wilson High School","Wright High School"]

In [135]:
# A dictionary of high schools and the type of school.
high_school_types = [{"High School": "Griffin", "Type":"District"},
                    {"High School": "Figueroa", "Type": "District"},
                    {"High School": "Wilson", "Type": "Charter"},
                    {"High School": "Wright", "Type": "Charter"}]

In [136]:
for school in high_schools:
    print(school)

Hernandez High School
Figueroa High School
Wilson High School
Wright High School

In [137]:
for high_school_types in high_school_types:
    display(high_school_types)

{'High School': 'Griffin', 'Type': 'District'}

{'High School': 'Figueroa', 'Type': 'District'}

{'High School': 'Wilson', 'Type': 'Charter'}

{'High School': 'Wright', 'Type': 'Charter'}

In [138]:
# List of high schools
high_schools = ["Huang High School",  "Figueroa High School", "Shelton High School", "Hernandez High School","Griffin High School","Wilson High School", "Cabrera High School", "Bailey High School", "Holden High School", "Pena High School", "Wright High School","Rodriguez High School", "Johnson High School", "Ford High School", "Thomas High School"]

In [139]:
# Add the Pandas dependency.
import pandas as pd

In [140]:
# Create a Pandas Series from a list.
school_series = pd.Series(high_schools)

In [141]:
# Create a Pandas Series from a list.
school_series = pd.Series(high_schools)
school_series

0         Huang High School
1      Figueroa High School
2       Shelton High School
3     Hernandez High School
4       Griffin High School
5        Wilson High School
6       Cabrera High School
7        Bailey High School
8        Holden High School
9          Pena High School
10       Wright High School
11    Rodriguez High School
12      Johnson High School
13         Ford High School
14       Thomas High School
dtype: object

In [142]:
#4.3.5 - Skill Drill
for i in school_series:
    print(i)

Huang High School
Figueroa High School
Shelton High School
Hernandez High School
Griffin High School
Wilson High School
Cabrera High School
Bailey High School
Holden High School
Pena High School
Wright High School
Rodriguez High School
Johnson High School
Ford High School
Thomas High School

In [143]:
# A dictionary of high schools
high_school_dicts = [{"School ID": 0, "school_name": "Huang High    School", "type": "District"},
                   {"School ID": 1, "school_name": "Figueroa High School", "type": "District"},
                    {"School ID": 2, "school_name":"Shelton High School", "type": "Charter"},
                    {"School ID": 3, "school_name":"Hernandez High School", "type": "District"},
                    {"School ID": 4, "school_name":"Griffin High School", "type": "Charter"}]

In [144]:
school_df = pd.DataFrame(high_school_dicts)
school_df

   School ID            school_name      type
0          0   Huang High    School  District
1          1   Figueroa High School  District
2          2    Shelton High School   Charter
3          3  Hernandez High School  District
4          4    Griffin High School   Charter

In [145]:
# Three separate lists of information on high schools
school_id = [0, 1, 2, 3, 4]

school_name = ["Huang High School", "Figueroa High School",
"Shelton High School", "Hernandez High School","Griffin High School"]

type_of_school = ["District", "District", "Charter", "District","Charter"]

In [171]:
# Initialize a new DataFrame.
schools_df = pd.DataFrame()

In [189]:
#Add each list to the empty schools_df DataFrame
schools_df["School ID"] = school_id
schools_df

   0  School ID
0  0          0
1  1          1
2  2          2
3  3          3
4  4          4

In [173]:
# Add the list to a new DataFrame.
schools_df["School ID"] = school_id 

# Print the DataFrame.
schools_df

   0  School ID
0  0          0
1  1          1
2  2          2
3  3          3
4  4          4

In [149]:
#Add the school name list and the type of school list to the schools_df
schools_df = pd.DataFrame(high_school_dicts)
# Print the DataFrame.
schools_df

   School ID            school_name      type
0          0   Huang High    School  District
1          1   Figueroa High School  District
2          2    Shelton High School   Charter
3          3  Hernandez High School  District
4          4    Griffin High School   Charter

In [150]:
# Create a dictionary of information on high schools.
high_schools_dict = {'School ID': school_id, 'school_name':school_name, 'type':type_of_school}

In [151]:
school_df = pd.DataFrame(high_schools_dict)
school_df

   School ID            school_name      type
0          0      Huang High School  District
1          1   Figueroa High School  District
2          2    Shelton High School   Charter
3          3  Hernandez High School  District
4          4    Griffin High School   Charter

In [152]:
school_df.columns

Index(['School ID', 'school_name', 'type'], dtype='object')

In [153]:
school_df.index

RangeIndex(start=0, stop=5, step=1)

In [154]:
school_df.values

array([[0, 'Huang High School', 'District'],
       [1, 'Figueroa High School', 'District'],
       [2, 'Shelton High School', 'Charter'],
       [3, 'Hernandez High School', 'District'],
       [4, 'Griffin High School', 'Charter']], dtype=object)

In [164]:
#skill drill: Create a list for each column and add each list to a new Pandas DataFrame.

school_dict = {
                "school_id" : [0, 1, 2, 3, 4],
                "school_name" : ["Huang High School", 
                                "Figueroa High School", 
                                 "Shelton High School", 
                                 "Hernandez High School", 
                                 "Griffin High School"],
                "type_of_school" : ["District", 
                                    "District", 
                                    "Charter", 
                                    "District", 
                                    "Charter"]}

school_df = pd.DataFrame(school_dict)
school_df

   school_id            school_name type_of_school
0          0      Huang High School       District
1          1   Figueroa High School       District
2          2    Shelton High School        Charter
3          3  Hernandez High School       District
4          4    Griffin High School        Charter